re-former/app/controllers/users_controller.rb

  def create
    #@user = User.new(user_params)
    @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user1"], ["email", "user@example.com"], ["password", "password"], ["created_at", "2017-06-07 00:15:39.284264"], ["updated_at", "2017-06-07 00:15:39.284264"]]

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "password2"], ["updated_at", "2017-06-07 00:53:50.840022"], ["id", 1]]